tap "buo/cask-upgrade"
tap "oven-sh/bun"
# wget Internet file retriever
brew "wget"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Statically typed programming language for the JVM
brew "kotlin"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate scripting interfaces to C/C++ code
brew "swig"
# General-purpose lossless data-compression library
brew "zlib"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes package manager
brew "helm"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Official Amazon AWS command-line interface
brew "awscli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Bun is an all-in-one toolkit for JavaScript and TypeScript apps
brew "bun"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Fast, disk space efficient package manager
brew "pnpm"
# Program that displays statistics about your code
brew "tokei"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Shell history search with sync and TUI
brew "atuin"
# Smarter cd command
brew "zoxide"
# Per-directory environment loader
brew "direnv"
# Syntax-highlighting pager for git and diff
brew "git-delta"
# Static analysis and lint tool, for sh/bash scripts
brew "shellcheck"
# Modern ls replacement with icons and git info
brew "eza"
# Modern terminal resource monitor
brew "btop"
# Official tldr client written in Rust
brew "tlrc"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Intuitive find & replace CLI
brew "sd"
# Cross-platform build automation system, that generates recipes for native build systems.
brew "cmake"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Golang
brew "go"
# GitHub command-line tool
brew "gh"
# Simple terminal UI for git commands
brew "lazygit"
# Handy way to save and run project-specific commands
brew "just"
# Autoformat shell script source code
brew "shfmt"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Command-line benchmarking tool
brew "hyperfine"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for ps written in Rust
brew "procs"
# Executes commands in response to file modifications
brew "watchexec"
# Search and rewrite code at large scale using AST patterns
brew "ast-grep"
# Blazing fast terminal file manager written in Rust
brew "yazi"
# Mac App Store command-line interface
brew "mas"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "maccy"
# Latest LTS JDK from the Eclipse Foundation (Adoptium)
cask "temurin@25"
# Google Chrome
cask "google-chrome"
# Google Cloud SDK
cask "google-cloud-sdk"
# Spotify
cask "spotify"
# TempBox
cask "tempbox"
# Fira Code
cask "font-fira-code"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Hidden Bar lets you hide menu bar items to give your Mac a cleaner look.
cask "hiddenbar"
# E-books management software
cask "calibre"
# Open-source code editor
cask "visual-studio-code"
# Peer-to-peer BitTorrent client
cask "qbittorrent"
# Multimedia player
cask "vlc"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# REST, GraphQL and gRPC client
cask "yaak"
# Software for Logitech devices
cask "logi-options+"
# Video communication and virtual meeting platform
cask "zoom"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Write, edit, and chat about your code with AI
cask "cursor"
# AtkynsonMono Nerd Font (Atkinson Hyperlegible Mono)
cask "font-atkynson-mono-nerd-font"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Controller for Insta360 webcams
cask "insta360-link-controller"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Application uninstaller
cask "appcleaner"
# Control external monitor brightness and volume
cask "monitorcontrol"
# System monitor in your menu bar
cask "stats"
